tap "homebrew/bundle"
brew "bat"
brew "deno"
brew "eza"
brew "fzf"
brew "hyperfine"
brew "micro"
brew "ox"
brew "ripgrep"
brew "starship"
brew "yadm"
brew "yazi"
brew "zig"
brew "zoxide"
vscode ""

# From mac
tap "dail8859/notepadnext"
tap "homebrew/bundle"
tap "martinfekete10/tap"
tap "wtfutil/wtfutil"
brew "bat"
brew "bottom"
brew "btop"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fish"
brew "fzf"
brew "gettext"
brew "git"
brew "go"
brew "gping"
brew "node"
brew "gtop"
brew "hyperfine"
brew "jless"
brew "libgpg-error"
brew "libplist"
brew "lsix"
brew "python@3.12"
brew "llvm"
brew "lsd"
brew "micro"
brew "neovim"
brew "ox"
brew "pinentry-mac"
brew "pkg-config"
brew "powerlevel10k"
brew "presenterm"
brew "procs"
brew "pure"
brew "pyinvoke"
brew "ripgrep"
brew "rsync"
brew "sevenzip"
brew "spaceship"
brew "sshs"
brew "starship"
brew "superfile"
brew "tree"
brew "wtfutil"
brew "yazi"
brew "zoxide"
cask "adobe-acrobat-reader"
cask "alacritty"
cask "alt-tab"
cask "arc"
cask "battery"
cask "codeedit"
cask "discord"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "github"
cask "gitify"
cask "hyper"
cask "istat-menus"
cask "jordanbaird-ice"
cask "keka"
cask "kitty"
cask "loop"
cask "meetingbar"
cask "notepadnext"
cask "ollama"
cask "openinterminal-lite"
cask "orion"
cask "reminders-menubar"
cask "rio"
cask "sigmaos"
cask "spacedrive"
cask "spotify"
cask "stats"
cask "tabby"
cask "tachidesk-sorayomi"
cask "tuneful"
cask "wave"
cask "wezterm"
cask "zed"
vscode "bierner.markdown-preview-github-styles"
vscode "dbaeumer.vscode-eslint"
vscode "dchanco.vsc-invoke"
vscode "eamodio.gitlens"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.activitusbar"
vscode "gruntfuggly.todo-tree"
vscode "hookyqr.beautify"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "matepek.vscode-catch2-test-adapter"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vsliveshare.vsliveshare"
vscode "spmeesseman.vscode-taskexplorer"
vscode "sysoev.language-stylus"
vscode "tht13.rst-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "uctakeoff.vscode-counter"
