# yadm Brewfile essentials to bootstrap a new install
tap "homebrew/bundle"
tap "veeso/termscp" # only for termscp
brew "asciinema"
brew "bat"
brew "bottom"
brew "bun"
brew "delta"
brew "diskonaut"
brew "dua"
brew "eget" # eget goto
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gdu"
brew "git" unless system "command -v git &> /dev/null"
brew "go"
brew "gh"
brew "gping"
brew "gron"
brew "hyperfine"
brew "jless"
brew "jq"
brew "llvm"
brew "neovim"
brew "node"
brew "mas" if OS.mac?
brew "micro"
brew "procs"
brew "ripgrep"
brew "rsync" unless system "command -v rsync &> /dev/null"
brew "rust"
brew "rustup"
brew "silicon"
brew "sshs"
brew "superfile"
brew "termscp"
brew "tree"
brew "yadm"
brew "yazi"
brew "zig"
brew "zoxide"

# Prefer casks for mac apps
cask "1password"
cask "1password-cli"
cask "adobe-acrobat-reader"
cask "alacritty"
cask "alt-tab"
cask "arc"
cask "battery"
cask "codeedit"
cask "discord"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "github"
cask "gitify"
cask "hyper"
cask "istat-menus"
cask "jordanbaird-ice"
cask "keka"
cask "kitty"
cask "loop"
cask "meetingbar"
cask "notepadnext"
cask "ollama"
cask "openinterminal-lite"
cask "orion"
cask "reminders-menubar"
cask "rio"
cask "sigmaos"
cask "spacedrive"
cask "spotify"
cask "stats"
cask "tabby"
cask "tachidesk-sorayomi"
cask "tuneful"
cask "wave"
cask "wezterm"
cask "zed"


# Some vscode extensions I had installed apparently
vscode "bierner.markdown-preview-github-styles"
vscode "dbaeumer.vscode-eslint"
vscode "dchanco.vsc-invoke"
vscode "eamodio.gitlens"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.activitusbar"
vscode "gruntfuggly.todo-tree"
vscode "hookyqr.beautify"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "matepek.vscode-catch2-test-adapter"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vsliveshare.vsliveshare"
vscode "spmeesseman.vscode-taskexplorer"
vscode "sysoev.language-stylus"
vscode "tht13.rst-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "uctakeoff.vscode-counter"
