# yadm Brewfile essentials to bootstrap a new install
# TODO: separate them into separate brewfiles to auto install more specific utilities

# brew "asciinema"
brew "bat"
brew "bottom"
brew "oven-sh/bun/bun"
# brew "deno"
# brew "direnv"
brew "diskonaut"
brew "dua-cli"
# brew "eget" # sshs > goto currently, add eget back when it's needed
brew "erdtree"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gdu"
brew "git" unless system "command -v git &> /dev/null"
brew "git-delta"
brew "go"
brew "gh"
# brew "orangekame3/tap/ghfetch"
brew "gping"
# brew "gron"
brew "hyperfine"
# brew "jq" # I can use otree
brew "lazygit"
# brew "llvm"
# brew "neovim" # maybe someday...
# brew "node"
brew "mas" if OS.mac?
brew "micro" # only in case flow is not an options
brew "otree"
brew "ouch"
brew "presenterm"
brew "ripgrep"
brew "rsync" unless system "command -v rsync &> /dev/null"
# brew "rust"
# brew "rustup"
brew "silicon"
brew "sshs"
brew "trntv/sshed/sshed"
brew "superfile"
brew "veerso/termscp/termscp"
brew "tlrc"
brew "charmbracelet/tap/wishlist"
brew "wtfutil/wtfutil/wtfutil"
brew "yadm"
brew "yazi"
# brew "zig"
# brew "zls"
brew "zoxide"
brew "zsh" unless system "command -v zsh &> /dev/null"

# Server
# brew "lazydocker"
# brew "oxker"

# Prefer casks for mac apps
cask "1password"
cask "1password-cli"
cask "adobe-acrobat-reader"
cask "alacritty"
cask "alt-tab"
# cask "arc" # RIP
cask "battery"
cask "codeedit"
cask "discord"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "github"
cask "gitify"
cask "gitlight"
cask "google-chrome"
cask "hyper"
cask "istat-menus"
cask "jordanbaird-ice"
cask "keka"
cask "kitty"
cask "loop"
cask "meetingbar"
cask "dail8859/notepadnext/notepadnext"
cask "ollama-app"
cask "openinterminal-lite"
cask "orion"
cask "paintbrush"
cask "readdle-spark"
cask "reminders-menubar"
cask "rio"
cask "sigmaos"
cask "spacedrive"
cask "spotify"
cask "stats"
cask "tabby"
cask "tachidesk-sorayomi"
cask "tuneful"
cask "wave"
cask "wezterm"
cask "zed"

# MAS apps installed... to be pruned
mas "Actions", id: 1586435171
mas "Bear", id: 1091189122
mas "Dropover", id: 1355679052
mas "Folder Peek", id: 1615988943
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PDFgear", id: 6469021132
mas "PiPad", id: 1482575592
mas "Tuneful", id: 6739804295

# Some vscode extensions I had installed apparently
vscode "bierner.markdown-preview-github-styles"
vscode "dbaeumer.vscode-eslint"
vscode "dchanco.vsc-invoke"
vscode "eamodio.gitlens"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.activitusbar"
vscode "gruntfuggly.todo-tree"
vscode "hookyqr.beautify"
vscode "kevinkyang.auto-comment-blocks"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "matepek.vscode-catch2-test-adapter"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "mylesmurphy.prettify-ts"
vscode "oven.bun-vscode"
vscode "quicktype.quicktype"
vscode "seunlanlege.action-buttons"
vscode "spencerwmiles.vscode-task-buttons"
vscode "spmeesseman.vscode-taskexplorer"
vscode "svelte.svelte-vscode"
vscode "sysoev.language-stylus"
vscode "tht13.rst-vscode"
vscode "tomoki1207.pdf"
vscode "uctakeoff.vscode-counter"